cases/on-caso-1/fluid/constant/fluidProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fluidProperties;
}

fluidModel pimpleFluid;

pimpleFluidCoeffs
{}
