cases/on-caso-1/fluid/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      preciceDict;
}

// on-caso-1 preCICE adapter (lado FLUIDO).
//   Escreve 'Force' nas 2 patches FSI (fsi_pia, fsi_dura) -> Solid-Mesh.
//   Le 'Displacement' do solido para mover a malha do fluido (two-way).
//
// No on-caso-1 nao ha mais walls FSI no cul-de-sac distal: o lid poroso
// substitui as paredes da tampa peripapilar. Restam apenas as 2 paredes
// laterais do SAS (pia em r=1.55 e dura em r=2.35).

preciceConfig "../precice-config.xml";

participant Fluid;

modules ( FSI );

interfaces
{
    Interface1
    {
        mesh              Fluid-Mesh;
        patches           ( fsi_pia fsi_dura );
        locations         faceCenters;

        readData          ( Displacement );
        writeData         ( Force );
    };
};

FSI
{
    // rho usado pelo adapter para converter p_kinematico * rho * S em Force
    rho rho [1 -3 0 0 0 0 0] 1000;
}
